# CustomWeapon шейдер

## Шейдер для скинов из CS:GO, используется на моделях оружия и ножах

- Игра берёт оригинальный вмт модели (тот что в ``\v_models\weapons\``)
- Игра берёт ``phongalbedoboost`` скина и оригинального вмт
    
- Появляется новая переменная ``phongalbedofactor``, которая равна единице по умолчанию
если ``phongalbedoboost`` скина не указан, то ``phongalbedofactor`` = ``phongalbedoboost`` оригинального вмт
иначе phongalbedofactor равен формуле ```[phongalbedoboost оригинального вмт разделить на phongalbedoboost скина]```
- потом идёт проверка что больше: ``phongalbedoboost`` скина или оригинального вмт и выбирается тот, что больше
далее если ``phongboost`` оригинального вмт больше единицы, то если style скина **не** равен ``4, 5, 6 и 8``, то ``phongintensity`` равен формуле ```[phongintensity разделить на phongboost оригинального вмт]```
- если ``phongboost`` оригинального вмт больше единицы, то если ``style`` скина равен ``4, 5, 6, 8 или 9``, то переменная ``phongalbedotint`` ставится в значение ``1`` и переменная ``phongalbedoboost`` в `vmt` ставится тому что ранее было посчитано
потом отключается енвмапа (``envmaptint 0``)

##### Спасибо за информацию PiMoNFeed
